from typing import Literal

ApartmentTypes = Literal[
    "Квартира", 
    "Частный дом", 
    "Офисное помещение", 
    "Коммерческое помещение", 
    "Квартира-апаратменты", 
    "Другое"
]
RoomTypes = Literal[
    "Кухня", 
    "Гостиная", 
    "Спальня", 
    "Детская", 
    "Санузел", 
    "Прихожая", 
    "Кабинет", 
    "Гардеробная", 
    "Балкон / лоджия", 
    "Полностью всё помещение"
]
ApartmentStyles = Literal[
    "Современный", 
    "Минимализм", 
    "Скандинавский", 
    "Лофт", 
    "Неоклассика", 
    "Классика", 
    "Пока не определился"
]